{
  "WorkshopId": 3568648352,
  "Title": "Vendor Action Events (library)",
  "Description": "Current Version is v0.0.3\n\n[h3]Now safer(er) to add mid-save![/h3]\nTwo attributes with which you can decorate an IPart are now available to ensure that the part in question is added to either the vendor [AlwaysHandlesVendor_UD_VendorActions] or an item in the trade UI [AlwaysHandlesItem_UD_VendorActions] prior to the trade window opening (vendor) or the tradeline for the item attempts to collect any vendor actions. Parts decorated with one of these attributes should ensure they do any setup that would occur during object creation in an override of \"AddedAfterCreation\" so that the part is primed for immediate use.\n\nFurthermore, a new flag is avaialable which returns true or false on the basis of this mod library being present during world generation for a given save. UD_Vendor_Actions.Startup.SaveStartedWithVendorActions is a good way to check during a [CallAfterGameLoaded] whether any setup was missed during world-gen and perform it then instead.\n\nIf, for whatever reason, a vendor actions list is completely empty, the base-game's implementation will be fallen back to. \n\nFinally, experimentally, updates that change things substantially enough are now capable of giving the player a warning when loading a run with an older version of the mod which may have compatibility issues, including advice on how to \"undo\" the migration (typically, alt+f4 and downdate the mod).\n\nNot perfect, but substantially more robust!\n\n[h2]Vendor Actions[/h2]\n\nThis is a mod library. It contains a small collection of events that mirror InventoryActions but for actions a vendor (trader) can take on behalf of the player during a trade. Existing actions include the librarian being able to allow the player to read donated books, and tinker NPCs identifying, repairing, and recharging items, as well as simply being able to \"look\" at items in the trade window.\n\nOn its own, this mod simply moves the existing vendor actions offered in the TradeUI to be in reponse to the set of custom events made available by this mod. The difference is only cosmetic (certain UI options are lower-case to match their hotkey) without another mod to make use of these events with custom vendor actions.\n\nA couple of short guides will be posted on the mod's github when I get a chance, but if you want to make use of this mod before then, feel free to hit me up for assistance, I'll do my best.\n\nIf you're at all familiar with InventoryActions then this will be familiar territory, with only a few differences/additions. I've attempted to maintain a similar nomenclature to the base game, both for ease of use, and for ease of transition if the functionality is ever \"vanillarised\".\n\n[h2]Disclaimer[/h2]\nI'm a hobbyist at absolute best, and a hack at the best of times, so, while I'll do my best to keep this updated and working, it's entirely possible there'll be some time between game updates and this mod being updated, and some time between being reported bugs with it and their eventual fix.\n\nThere's also a BitBucket issue with a [url=https://bitbucket.org/bbucklew/cavesofqud-public-issue-tracker/issues/13656]request for this functionality[/url] to be included in the base game. In the event that's implemented, this library will be depricated and phased out in favor that.\n\nI'm open to collaborating on this mod in the interim, so if you think this library is missing something integral or implements something poorly, let me know, and we'll see what we can work out.\n\nThis library depends on [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3568646682]UnderDoug's Modding Toolbox[/url].\r\n\r\n[h2]Source[/h2]\r\nWant to see how it's made? There's a [url=https://github.com/UnderDoug/UD_Vendor_Actions/]git repository[/url]!\r\n\r\nLicence is the \"Unlicence\". I don't know what that means, but I also don't care what you do with it. Easy.",
  "Tags": "Trading,Extension,Library",
  "Visibility": "2",
  "ImagePath": "preview.png"
}